dataset_gen/OpenFoam_Shapes/Square/design_points/design_point_1/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
9600
(
(-0.21645382 -7.3698393 0.5)
(0.030744344 -7.3698393 0.5)
(0.27794251 -7.3698393 0.5)
(0.52514068 -7.3698393 0.5)
(0.77233884 -7.3698393 0.5)
(1.019537 -7.3698393 0.5)
(1.2667351 -7.3698393 0.5)
(1.5139333 -7.3698393 0.5)
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<vector> 
160
(
(4.1164104 2.9524956 0.5)
(4.1414104 2.9524956 0.5)
(4.1664104 2.9524956 0.5)
(4.1914104 2.9524956 0.5)
(4.2164104 2.9524956 0.5)
(4.2414104 2.9524956 0.5)
(4.2664104 2.9524956 0.5)
(4.2914104 2.9524956 0.5)
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(-0.27108957 -7.5 0.5)
(-0.02108957 -7.5 0.5)
(0.22891043 -7.5 0.5)
(0.47891043 -7.5 0.5)
(0.72891043 -7.5 0.5)
(0.97891041 -7.5 0.5)
(1.2289104 -7.5 0.5)
(1.4789104 -7.5 0.5)
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(9.4789104 7.5 0.5)
(9.2289104 7.5 0.5)
(8.9789104 7.5 0.5)
(8.7289104 7.5 0.5)
(8.4789104 7.5 0.5)
(8.2289104 7.5 0.5)
(7.9789104 7.5 0.5)
(7.7289104 7.5 0.5)
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(-15 7.3125 0.5)
(-15 6.9375 0.5)
(-15 6.5625 0.5)
(-15 6.1875 0.5)
(-15 5.8125 0.5)
(-15 5.4375 0.5)
(-15 5.0625 0.5)
(-15 4.6875 0.5)
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(15 -7.3125 0.5)
(15 -6.9375 0.5)
(15 -6.5625 0.5)
(15 -6.1875 0.5)
(15 -5.8125 0.5)
(15 -5.4375 0.5)
(15 -5.0625 0.5)
(15 -4.6875 0.5)
...
)
;
    }
}


// ************************************************************************* //
