dataset_gen/OpenFoam_Shapes/Square/design_points/design_point_1/0/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9600
(
-0.21645382
0.030744344
0.27794251
0.52514068
0.77233884
1.019537
1.2667351
1.5139333
...
)
;

boundaryField
{
    FrontBack
    {
        type            empty;
    }
    Cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
4.1164104
4.1414104
4.1664104
4.1914104
4.2164104
4.2414104
4.2664104
4.2914104
...
)
;
    }
    Bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-0.27108957
-0.02108957
0.22891043
0.47891043
0.72891043
0.97891041
1.2289104
1.4789104
...
)
;
    }
    Top
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
9.4789104
9.2289104
8.9789104
8.7289104
8.4789104
8.2289104
7.9789104
7.7289104
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           uniform -15;
    }
    Outlet
    {
        type            calculated;
        value           uniform 15;
    }
}


// ************************************************************************* //
